Revit 2027 API
ElementType.IsSimilarType Method
 Checks if given type is similar to this type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSimilarType(
	ElementId typeId
)
Public Function IsSimilarType (
	typeId As ElementId
) As Boolean
public:
bool IsSimilarType(
	ElementId^ typeId
)
member IsSimilarType :
        typeId : ElementId -> bool
Parameters
typeId ElementId
 ElementId of the type to check.
Return Value
Boolean
 True if given type is similar to this type, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Two types are similar if elements that have one type could be assigned the other type.
See Also
Reference
ElementType Class
Autodesk.Revit.DB Namespace